app/Controllers/ClienteController.php

SELECT *
FROM `clientes`
---
    public function listado() {
        $modelo = new ClienteModel();
        $datos['clientes'] = $modelo->findAll();